src/Tasks/Взаимодействие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Task>
		<Properties>
			<Name>Взаимодействие</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТриггерноеСобытие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТриггерныеСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаТема</Name>
					<Comment>Содержание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПредмет</Name>
					<Comment>Предмет задачи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланЛечения</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОписание</Name>
					<Comment>Подробное описание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаАвтор</Name>
					<Comment>Автор бизнес-процесса, который сформировал задачу</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаНазначеннаяДатаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаНазначеннаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Comment>Дата и время фактического выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительФактический</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВзаимодействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВзаимодействияСправочник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаимодействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеСостоялось</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеИспользовать</Name>
					<Comment>Напоминать о задаче</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНапоминания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыНапоминаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НапоминаниеДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереносов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксСинхронизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеПредставление</Name>
					<Comment>Представление задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
						<v8:Type>cfg:CatalogRef.Заявки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

src/Tasks/Взаимодействие/Forms/ФормаНапоминания/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик при создании формы на сервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Загрузить таблицу значениями
	Если Параметры.Свойство("Задачи") Тогда
			
		Для Каждого ЭлМассива ИЗ Параметры.Задачи Цикл
			
			НоваяСтрока               = ТаблицаЗадач.Добавить();
			НоваяСтрока.Задача        = ЭлМассива;
			НоваяСтрока.Представление = ?(ТипЗнч(ЭлМассива) = Тип("ЗадачаСсылка.Взаимодействие"), ЭлМассива.ВзаимодействиеПредставление, ЭлМассива.ЗадачаИсполнителяПредставление);
			НоваяСтрока.Картинка      = Истина;

		КонецЦикла;
		
    КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработка оповещения формы
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Оповещение об изменении состояния задачи пользователя
	Если ИмяСобытия = "ЗадачаПользователя" И ТипЗнч(Параметр) = Тип("ЗадачаСсылка.Взаимодействие") Тогда
					
	     ПриИзмененеииСостоянияЗадачи(Параметр);

		 Если ТаблицаЗадач.Количество() = 0 Тогда
			Закрыть();
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадачи

&НаКлиенте
// Выбор задачи в таблице
Процедура ЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	// Открываем форму задачи
    ФормаЗадачи = ПолучитьФорму("Задача.Взаимодействие.ФормаОбъекта",Новый Структура("Ключ", Элементы.Задачи.ТекущиеДанные.Задача));
    ФормаЗадачи.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
                                       
&НаКлиенте
// Обработчик выполнения задачи
Процедура ВыполнитьЗадачу(Команда)
	
	ТекущиеДанные = Элементы.Задачи.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 

       ВыполнитьЗадачуСервер(ТекущиеДанные.Задача);
	   
	   ОповеститьОбИзменении(ПредопределенноеЗначение("Задача.Взаимодействие.ПустаяСсылка"));
	    
	   ТаблицаЗадач.Удалить(ТекущиеДанные);
	   
	   Если ТаблицаЗадач.Количество() = 0 Тогда
			Закрыть();
	   КонецЕсли;

	   Оповестить("ИзменениеСпискаВзаимодействий");
	   
     КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик прекращения напоминания о задаче
Процедура ПрекратитьНапоминания(Команда)
	
	ТекущиеДанные = Элементы.Задачи.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 
		
	    ПрекратитьНапоминанияСервер(ТекущиеДанные.Задача);
	    ОповеститьОбИзменении(ТекущиеДанные.Задача);
	    ТаблицаЗадач.Удалить(ТекущиеДанные);
		
        Если ТаблицаЗадач.Количество() = 0 Тогда
			Закрыть();
		КонецЕсли;

    КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик откладывания выполнения задачи
Процедура Перенести(Команда)
	
	ТекущиеДанные = Элементы.Задачи.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда 

		ПеренестиСервер(Команда.Имя, ТекущиеДанные.Задача);
		ТаблицаЗадач.Удалить(ТекущиеДанные);

		Если ТаблицаЗадач.Количество() = 0 Тогда
			Закрыть();
		КонецЕсли;
	
    КонецЕсли;
  
КонецПроцедуры

&НаКлиенте
// Процедура - Перенести все
//
// Параметры:
//  Команда	 - 	 - 
//
Процедура ПеренестиВсе(Команда)
	
	Если ТаблицаЗадач.Количество() <> 0 Тогда 
		ПеренестиСервер(Команда.Имя, , Истина);
		ТаблицаЗадач.Очистить();

		Если ТаблицаЗадач.Количество() = 0 Тогда
			Закрыть();
		КонецЕсли;
    КонецЕсли;
  
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Выполинть задачу, записать объект 
Процедура ВыполнитьЗадачуСервер(Задача)
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗадачаОбъект                = Задача.ПолучитьОбъект();
	ЗадачаОбъект.ДатаИсполнения = ТекущаяДата();
	ЗадачаОбъект.Выполнена      = Истина;
	ЗадачаОбъект.Записать();

КонецПроцедуры

&НаСервере
// Прекратить напоминание о задаче, записать объект
Процедура ПрекратитьНапоминанияСервер(Задача)
	
	ЗадачаОбъект                         = Задача.ПолучитьОбъект();
	ЗадачаОбъект.НапоминаниеИспользовать = Ложь;
	ЗадачаОбъект.Записать();
	
КонецПроцедуры

&НаСервере
// Отложить напоминание о задаче, записать объект
Процедура ПеренестиСервер(Интервал, Задача = Неопределено, Все = Ложь)
	
	Если НЕ Задача = Неопределено Тогда 
		ЗадачаОбъект                       = Задача.ПолучитьОбъект();
	КонецЕсли;
	Если Все = Истина Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ИмяКоманды"			, Интервал);
		СтруктураПараметров.Вставить("ТаблицаЗадач"			, ДанныеФормыВЗначение(ЭтаФорма.ТаблицаЗадач, Тип("ТаблицаЗначений")));
		СтруктураПараметров.Вставить("ТочкаНаВременнойШкале", ТекущаяДатаСеанса());
		ПараметрыДлительнойОперации = ЗагрузкаПроведениеДокументов.ПеренестиНапоминанияПоЗадачам(Строка(УникальныйИдентификатор), СтруктураПараметров);
	Иначе
		ТочкаНаВременнойШкале = ТекущаяДатаСеанса();
		Если Интервал = "Завтра" Тогда
			ЗадачаОбъект.НапоминаниеДатаНачала = ТочкаНаВременнойШкале + 60*60*24;
			ЗадачаОбъект.ЗадачаНазначеннаяДата = ТочкаНаВременнойШкале + 60*60*24;
		ИначеЕсли Интервал = "Послезавтра" Тогда
			ЗадачаОбъект.НапоминаниеДатаНачала = ТочкаНаВременнойШкале + 60*60*24*2;
			ЗадачаОбъект.ЗадачаНазначеннаяДата = ТочкаНаВременнойШкале + 60*60*24*2
		ИначеЕсли Интервал = "Неделя"Тогда
			ЗадачаОбъект.НапоминаниеДатаНачала = ТочкаНаВременнойШкале + 60*60*24*7;
			ЗадачаОбъект.ЗадачаНазначеннаяДата = ТочкаНаВременнойШкале + 60*60*24*7;
		ИначеЕсли Интервал = "Месяц" Тогда
			ЗадачаОбъект.НапоминаниеДатаНачала = ДобавитьМесяц(ТочкаНаВременнойШкале, 1);
			ЗадачаОбъект.ЗадачаНазначеннаяДата = ДобавитьМесяц(ТочкаНаВременнойШкале, 1);
		КонецЕсли;
		Попытка
			ЗадачаОбъект.Записать();
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;	
	КонецЕсли;

КонецПроцедуры

&НаСервере
// При изменении состояния задачи обновить список задач
Процедура ПриИзмененеииСостоянияЗадачи(Задача)
	
	Если Задача.Выполнена ИЛИ  НЕ Задача.НапоминаниеИспользовать Тогда

		СтрокиУдаления = ТаблицаЗадач.НайтиСтроки(Новый Структура("Задача",Задача));
		Для А = 0 По  СтрокиУдаления.Количество()-1 Цикл
			
			ТаблицаЗадач.Удалить(СтрокиУдаления[А]);
			
		КонецЦикла;
							
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Выполинть задачу, записать объект 
Процедура ЗагрузитьЗадачи(МассивЗадач) Экспорт
	
	ТаблицаЗадач.Очистить();
	
	Для Каждого ЭлМассива ИЗ МассивЗадач Цикл
			
		НоваяСтрока               = ТаблицаЗадач.Добавить();
		НоваяСтрока.Задача        = ЭлМассива;
		НоваяСтрока.Представление = ЭлМассива.Наименование;
		НоваяСтрока.Картинка      = Истина;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
